Repository: StatCan/gensol-banff-processor
Catalog: src/banffprocessor/nls/messages/*/LC_MESSAGES/banffprocessor.po
Languages: fr

source: The following metadata file did not correspond to any existing metadata model and was skipped: {}.
fr: Le fichier de métadonnées suivant ne correspond à aucun modèle de métadonnées existant et a été ignoré: {}.

source: Provided metadata file {} contains no valid entries.
fr: Le fichier de métadonnées fourni {} ne contient aucune entrée valide.

source: Unable to read XML in {} metadata file.
fr: Impossible de lire le XML dans le fichier de métadonnées {}.

source: Required Jobs metadata not found or unable to be read.
fr: Les métadonnées « Jobs » requises n'ont pas été trouvées ou n'ont pas pu être lues.

source: Metadata constraint violated while processing {} on entry {}
fr: Contrainte de métadonnées violée lors du traitement de {} à l'entrée {}

source: 'objects' list is empty.
fr: La liste des « objets » est vide.

source: All objects in 'objects' list must be the same type.
fr: Tous les objets de la liste « objets » doivent être du même type.

source: No job steps were found with job_id {}.
fr: Aucune étape de stratégie n'a été trouvée avec job_id {}.

source: The Jobs sequence rooted at job_id {} contains a cycle caused by job_id {} at seqno {}. As this will result in an infinite loop the job must be rewritten to remove the cycle.
fr: La séquence d'étapes enracinée dans job_id {} contient un cycle causé par job_id {} à seqno {}. Comme cela entraînerait une boucle infinie, la tâche doit être réécrite pour supprimer le cycle.

source: Multiple entries using same specid ({}) in {} table. SpecIDs must be unique in Spec tables.
fr: Plusieurs entrées utilisant le même identifiant spécifique ({}) dans la table {}. Les identifiants spécifiques doivent être uniques dans les tables de spécifications.

source: The following value was not found: {} = '{}'.
fr: La valeur suivante n'a pas été trouvée : {} = '{}'.

source: Metadata Load Summary
fr: Résumé du chargement des métadonnées

source: Constraint violated in {} table:
fr: Contrainte violée dans la table {}:

source: {} value must be one of {}.
fr: La valeur {} doit être l'une des {}.

source: The following Edits belonging to an EditGroup are not defined: {}
fr: Les modifications d'enquête suivantes appartenant à un groupe de modifications ne sont pas définies : {}

source: ProcessControl record with controlid {}
fr: L'enregistrement de contrôle de processus avec l'ID de contrôle {}

source: has unrecognized parameter value {}.
fr: a une valeur de paramètre non reconnue {}.

source: is an EDIT_GROUP_FILTER control and therefore requires an empty value field.
fr: est un contrôle EDIT_GROUP_FILTER et nécessite donc un champ de valeur vide.

source: is missing a value for required fields 'value' and/or 'targetfile'
fr: manque une valeur dans l'entrée pour les champs obligatoires 'valeur' et/ou 'fichier cible'

source: may not contain any ';' characters in the value field.
fr: ne peut contenir aucun caractère ; dans le champ de valeur.

source: {} is a built-in algorithm and cannot be re-defined.
fr: {} est un algorithme intégré et ne peut pas être redéfini.

source: XML Issue detected related to {}: {}
fr: Problème XML détecté lié à {} : {}

source: Foreign key constraint violation between {}.{} and {}.{}.
fr: Violation de contrainte de clé étrangère entre {}.{} et {}.{}.

source: The following are not defined: {}.
fr: Les éléments suivants ne sont pas définis : {}.

source: {} value must be greater than {}.
fr: La valeur {} doit être supérieure à {}.

source: {} value must not contain any single or double quotes.
fr: La valeur {} ne doit pas contenir de guillemets simples ou doubles.

source: {} value must be greater than or equal to {}.
fr: La valeur {} doit être supérieure ou égale à {}.

source: Exponent value must be between 0 and 1 inclusive.
fr: La valeur exponent doit être comprise entre 0 et 1 inclus.

source: StartCentile value must be between 0 inclusive and 100 exclusive.
fr: La valeur StartCentile doit être comprise entre 0 inclus et 100 exclu.

source: variance fields must either all be empty or all have values.
fr: Les variables de variance doivent soit toutes être vides, soit toutes avoir des valeurs.

source: PercentCriteria value must be greater than 0 and less than 100.
fr: La valeur PercentCriteria doit être supérieure à 0 et inférieure à 100.

source: PcentDonors value must be between 1 inclusive and 100 exclusive.
fr: La valeur PcentDonors doit être comprise entre 1 inclus et 100 exclu.

source: Input parameters must be provided either via the input_params parameter or as part of the input_params property of the initial_data ProcessorData object.
fr: Les paramètres d'entrée doivent être fournis via le paramètre input_params ou dans le cadre de la propriété input_params de l'objet ProcessorData initial_data.

source: No explicit user plugins folder was set and no \plugins subfolder was found in the input folder. No plugins were loaded.
fr: Aucun dossier de plugins utilisateur explicite n'a été défini et aucun sous-dossier \plugins n'a été trouvé dans le dossier d'entrée. Aucun plugin n'a été chargé.

source: The current job_id value {} may have been found on the instatus file. If it was, the SEQNO and JOBID values for those records, and any with a missing JOBID, have been replaced with empty values.
fr: La valeur job_id actuelle {} a peut-être été trouvée dans le fichier instatus. Si c'est le cas, les valeurs SEQNO et JOBID de ces enregistrements, ainsi que toutes celles avec un JOBID manquant, ont été remplacées par des valeurs vides.

source: Error in byid field of job_id {} and seqno {}. Byid was set but does not refer to any varlists found in the varlist metadata.
fr: Erreur dans le champ byid de job_id {} et seqno {}. Byid a été défini mais ne fait référence à aucune liste de variables trouvée dans les métadonnées de la liste de variables.

source: Non-zero return code: {} returned by {} in job {} at seqno {}
fr: Code de retour différent de zéro : {} renvoyé par {} dans la stratégie {} à seqno {}

source: Indata or instatus were modified. If this was not intended make sure that any new tables you create are not saved back to the processor_data object. Instead save your updates to the outdata and outstatus attributes on processor_data
fr: Indata ou instatus ont été modifiés. Si cela n'était pas prévu, assurez-vous que les nouvelles tables que vous créez ne sont pas enregistrées dans l'objet processor_data. Enregistrez plutôt vos mises à jour des attributs outdata et outstatus sur processor_data

source: Process {} in job {} at seqno {} set an outstatus dataset but it was empty.
fr: Le processus {} dans le job {} au seqno {} a défini un ensemble de données de statut sortant, mais il était vide.

source: Process {} in job {} at seqno {}. processor_data.outstatus should not reference the same dataset as instatus.
fr: Le processus {} dans le job {} au seqno {}. processor_data.outstatus ne doit pas référencer le même ensemble de données que instatus.

source: Process {} in job {} at seqno {} set an outdata dataset but it was empty.
fr: Le processus {} dans la stratégie {} au seqno {} a défini un ensemble de données de sortie, mais il était vide.

source: Process {} in job {} at seqno {}. processor_data.outdata should not reference the same dataframe as indata.
fr: Processus {} dans la stratégie {} au seqno {}. processor_data.outdata ne doit pas référencer le même dataframe que indata.

source: Job ID : {}
fr: ID de stratégie : {}

source: Banff Processor Version : {}
fr: Version du processeur Banff : {}

source: Banff Version : {}
fr: Version du Banff : {}

source: Support Email : {}
fr: Courriel d'assistance : {}

source: Start Time : {} ({})
fr: Heure de début : {} ({})

source: The Banff Processor executed {} successfully.
fr: Le processeur Banff a exécuté {} avec succès.

source: Duration: {}
fr: Durée: {}

source: JOBID: {}
fr: ID de stratégie: {}

source: PROCESS: {}
fr: PROCESSUS: {}

source: CONTROLID: {}
fr: ID DE CONTRÔLE: {}

source: END OF PROCESS: {}
fr: FIN DU PROCESSUS: {}

source: JOB PROGRESS: {}/{} - {}%
fr: PROGRESSION DE LA STRATÉGIE: {}/{} - {}%

source: START TIME: {}
fr: HEURE DE DÉBUT: {}

source: END TIME: {}
fr: HEURE DE FIN: {}

source: start_time or end_time must be datetime objects or floats.
fr: start_time ou end_time doivent être des objets datetime ou des floats.

source: STEP DURATION: {}
fr: DURÉE DE L'ÉTAPE: {}

source: TOTAL DURATION: {}
fr: DURÉE TOTALE: {}

source: TIMESTORE option was set but start_time and end_time were not passed in as datetime stamps.
fr: L'option TIMESTORE a été définie mais les heures de début et de fin n'ont pas été transmises comme horodatages.

source: STEP JOBID PROCESS SEQNO END TIME DURATION TOTAL DURATION PROGRESS
fr: ÉTAPE JOBID Processus SEQNO HEURE DE FIN DURÉE DURÉE TOTALE PROGRÈS

source: plugin_dir argument was empty or None.
fr: L'argument plugin_dir était vide ou None.

source: Prorate requires an instatus file for using the 'ORIGINAL' or 'IMPUTED' modifiers. No status_file dataframe was generated by any previous steps and no status file was provided in the input JSON file. Jobid: {} and seqno: {}
fr: Prorate nécessite un fichier instatus pour utiliser les modificateurs « ORIGINAL » ou « IMPUTED ». Aucune trame de données status_file n'a été générée par les étapes précédentes et aucun fichier d'état n'a été fourni dans le fichier JSON d'entrée. Jobid : {} et seqno : {}

source: An error occured during execution of this procedure.
fr: Une erreur s'est produite lors de l'exécution de cette procédure.

source: Outlierspecs metadata table indicated two data sets for this step so HISTORIC outlier method expects one of historic data file or auxillary data file but neither were able to be loaded.
fr: La table de métadonnées Outlierspecs a indiqué deux ensembles de données pour cette étape. La méthode HISTORIC outlier attend donc un fichier de données historiques ou un fichier de données auxiliaires, mais aucun des deux n'a pu être chargé.

source: Outlierspecs metadata table indicated two data sets for this step so RATIO or SIGMAP outlier method expects one of auxillary data file or historic data file but neither were able to be loaded.
fr: La table de métadonnées Outlierspecs indiquait deux ensembles de données pour cette étape, donc la méthode de valeur aberrante RATIO ou SIGMAP attend l'un des fichiers de données auxiliaires ou l'un des fichiers de données historiques, mais aucun des deux n'a pu être chargé.

source: Beginning execution of job {} from job {} at seqno {}
fr: Début de l'exécution de la sous-stratégie {} à partir de la stratégie d'imputation {} au seqno {}

source: Job {} complete.
fr: Job {} terminé.

source: MassImputation requires a mustimputeid but one was not provided.
fr: MassImputation nécessite un mustimputeid mais aucun n'a été fourni.

source: No Estimators were found under EstimatorID: {} for jobID: {} and seqno: {}
fr: Aucun estimateur n'a été trouvé sous EstimatorID : {} pour jobID : {} et seqno: {}

source: No editgroupid present for seqno {} under job with jobid {}. An editgroupid is required for Errorloc.
fr: Aucun editgroupid présent pour le seqno {} sous la stratégie avec jobid {}. Un editgroupid est requis pour Errorloc.

source: No edits found in Edits table for editgroupid {} at seqno {} under job with jobid {}. Edits are required for Errorloc.
fr: Aucune modification trouvée dans le tableau des modifications pour editgroupid {} à seqno {} sous la stratégie avec jobid {}. Des modifications sont requises pour Errorloc.

source: No editgroupid present for seqno {} under job with jobid {}. editgroupid is required for DonorImputation.
fr: Aucun editgroupid présent pour seqno {} sous la stratégie avec jobid {}. Editgroupid est requis pour DonorImputation.

source: No edits found in Edits table for editgroupid {} at seqno {} under job with jobid {}. Edits are required for DonorImputation.
fr: Aucune modification n'a été trouvée dans le tableau des modifications pour editgroupid {} à seqno {} sous la stratégie avec jobid {}. Des modifications sont requises pour DonorImputation.

source: VerifyEdits requires a set of edits to work but none were found for this job step.
fr: VerifyEdits nécessite un ensemble de modifications pour fonctionner, mais aucune n'a été trouvée pour cette étape de la stratégie

source: Unknown Procedure name {!r}
fr: Nom de procédure inconnu {!r}

source: Input parameter input_folder must be provided unless both metadata_folder and output_folder are provided.
fr: Le paramètre de dossier d'entrée doit être fourni, sauf si le dossier de métadonnées et le dossier de sortie sont tous deux fournis.

source: Input folder was not given but {} is a relative path.
fr: Le dossier d'entrée n'a pas été donné mais {} est un chemin relatif.

source: Parent folders in input parameter filepath output_folder: {} could not be found so output folder could not be created.
fr: Les dossiers parents dans le paramètre d'entrée filepath output_folder: {} n'ont pas pu être trouvés, le dossier de sortie n'a donc pas pu être créé.

source: Filepath in input parameter {}: {} is not accesible or does not exist.
fr: Le chemin du fichier dans le paramètre d'entrée {} : {} n'est pas accessible ou n'existe pas.

source: No valid job_id found in processor_input file.
fr: Aucun identifiant d'unité valide n'a été trouvé dans le fichier d'entrée du processeur.

source: ProcessorInput process_output_type field contains an unrecognized value.
fr: Le paramètre process_output_type de ProcessorInput contient une valeur non reconnue.

source: Invalid value in processor_input file: no_by_stats must be true, false or not specified.
fr: Valeur non valide dans le fichier d'entrée du processeur: no_by_stats doit être vrai, faux ou non spécifié.

source: save_format parameter of the input JSON file must be a list of supported file extensions or be excluded or empty.
fr: Le paramètre save_format du fichier JSON d'entrée doit être une liste d'extensions de fichiers prises en charge ou être exclu ou vide.

source: Filepath is not properly configured. Make sure that you use the full filepath of the input JSON file.
fr: Le chemin d'accès au fichier n'est pas correctement configuré. Assurez-vous d'utiliser le chemin d'accès complet du fichier JSON d'entrée.

source: input_filepath is not a JSON file. The input file parameters must be passed as the full filepath of the input JSON file.
fr: input_filepath n'est pas un fichier JSON. Les paramètres du fichier d'entrée doivent être transmis sous forme de chemin d'accès complet au fichier JSON d'entrée.

source: Unable to find JSON input file under input filepath {}
fr: Impossible de trouver le fichier d'entrée JSON sous le chemin d'accès au fichier d'entrée {}

source: invalid `lang`, expecting `SupportedLanguage` member
fr: « lang » non valide, membre `SupportedLanguage` attendu

source: Language not supported, using default language: {}
fr: Langue non prise en charge, langue par défaut utilisée : {}

source: {} does not exist or is not a file.
fr: {} n'existe pas ou n'est pas un fichier.

source: {} does not exist or is not a directory.
fr: {} n'existe pas ou n'est pas un fichier.

source: Creating XML files for: {}
fr: Création de fichiers XML pour: {}

source: XML files have been created sucessfully.
fr: Les fichiers XML ont été créés avec succès.

source: Dataset {} was empty and so was not able to be registered to Duckdb.
fr: L'ensemble de données {} était vide et n'a donc pas pu être enregistré dans Duckdb.

source: The Banff Processor does not currently support direct updates made to any datasets with a process control applied to them.
fr: Le processeur Banff ne prend actuellement pas en charge les mises à jour directes effectuées sur des ensembles de données avec un contrôle de processus qui leur est appliqué.

source: Output table {} was created but output settings exclude this table from saving for the current proc and so it was discarded.
fr: La table de sortie {} a été créée, mais les paramètres de sortie excluent cette table de l'enregistrement pour le processus en cours et elle a donc été supprimée.

source: dataset was given as a pyarrow table but no name was given for the table to update.
fr: L'ensemble de données a été donné sous forme de table pyarrow mais aucun nom n'a été donné pour la table à mettre à jour.

source: dataset was given as an invalid type. dataset must be of type str, pa.Table or Dataset.
fr: L'ensemble de données a été donné comme type non valide. L'ensemble de données doit être de type str, pa.Table ou Dataset.

source: update_imputed_file requires a unit_id value to sort and update on.
fr: update_imputed_file nécessite une valeur unit_id pour trier et mettre à jour.

source: Undefined control ID found: controlid ='{}', jobid='{}', seqno='{}'
fr: ID de contrôle non défini trouvé : controlid = '{}', jobid='{}', seqno='{}'

source: Process Control has an unrecognized target file value: targetfile='{}'
fr: Le contrôle de processus a une valeur de fichier cible non reconnue: targetfile='{}'

source: Target file exists but is empty: targetfile='{}'
fr: Le fichier cible existe mais est vide : targetfile='{}'

source: Too many EXCLUDEREJECTED controls for one targetfile.
fr: Trop de contrôles EXCLUDEREJECTED pour un fichier cible.

source: Too many EDIT_GROUP_FILTER controls for one targetfile.
fr: Trop de contrôles EDIT_GROUP_FILTER pour un fichier cible.

source: An EDIT_GROUP_FILTER process control was specified but no editgroupid was given in the metadata for the job step.
fr: Un contrôle de processus EDIT_GROUP_FILTER a été spécifié mais aucun editgroupid n'a été donné dans les métadonnées pour l'étape de stratégie d'imputation.

source: An EDIT_GROUP_FILTER process control was used but one or more required fields were missing (STATUS, JOBID and SEQNO) on the instatus file. The control has been skipped.
fr: Un contrôle de processus EDIT_GROUP_FILTER a été utilisé mais un ou plusieurs champs obligatoires manquaient (STATUS, JOBID et SEQNO) dans le fichier instatus. Le contrôle a été ignoré.

source: No supported controls found in process controls metadata.
fr: Aucun contrôle pris en charge n'a été trouvé dans les métadonnées des contrôles de processus.

source: A column filter was specified but none of the columns were found in targetfile.
fr: Un filtre de colonne a été spécifié mais aucune des colonnes n'a été trouvée dans le fichier cible.

source: Computed filter: {}
fr: Filtre calculé : {}

source: Process filter resulted in a dataset containing {} columns but 0 rows. Continuing...
fr: Le filtre de processus a généré un ensemble de données contenant {} colonnes mais 0 ligne. Continuant...

source: There was an error while applying process controls with controlid {} in job {} seqno {}. Exception: {}
fr: Une erreur s'est produite lors de l'application des contrôles de processus avec controlid {} dans la stratégie {} seqno {}. Exception : {}

source: Filter succesfully applied.
fr: Filtre appliqué avec succès.

source: ProcessOutputs metadata entry found under process {} with unrecognized output_name {}
fr: Entrée de métadonnées ProcessOutputs trouvée sous le processus {} avec un nom de sortie non reconnu {}

source: Output dataset {} was created but is empty.
fr: L'ensemble de données de sortie {} a été créé mais est vide.

source: No output folder set. Ouputs will not be saved.
fr: Aucun dossier de sortie défini. Les sorties ne seront pas enregistrées.

source: Input folder was not provided or data_file string was empty when attempting to load datafile without full filepath.
fr: Le dossier d'entrée n'a pas été fourni ou la chaîne data_file était vide lors de la tentative de chargement du fichier de données sans chemin de fichier complet.

source: Error while reading input data file {}
fr: Erreur lors de la lecture du fichier de données d'entrée {}

source: Filetype not supported or filename empty.
fr: Le type de fichier n'est pas pris en charge ou le nom de fichier est vide.

source: Dataset provided in parameter 'ds' is of an unsupported type. 'ds' must be a pandas Dataframe or pyarrow Table.
fr: L'ensemble de données fourni dans le paramètre « ds » est d'un type non pris en charge. « ds » doit être un Dataframe pandas ou une table pyarrow.

source: Unhandled exception occurred while converting PyArrow Table to Pandas DataFrame
fr: Une exception non gérée s'est produite lors de la conversion de la table de données PyArrow en trame de données Pandas

source: Unrecognized format parameter '{}'. Must be either of 'pyarrow' or 'pandas'
fr: Valeur de paramètre de format non reconnue « {} ». Ce paramètre doit être « pyarrow » ou « pandas »

source: Logging to {}
fr: Enregistrement dans le fichier {}
